#include <stdio.h>
void z1();
void z2();
void z3();

int main()
{
    printf("1 задание \n");
    z1();
    printf("\n 2 задание \n");
    z2();
    printf("\n 3 задание \n");
    z3();
}
void z1()
{

printf("%d\n %d\n  %d\n   %d\n",1,2,3,4); // подзадание 1
printf("%10.5f\n ", 12.234657); 
printf ("Остаток от деления %d на %d равен %d\n ",5, 2, 5%2); 
printf ("Остаток от деления %d на %d равен %d\n ",7, 5, 7%5); 
printf ("%g разделить %e равно %f\n ",5., 2000000., 5./2000000);
}

void z2()
{
int N=12, K=65;
printf("Сейчас %d часов %d часов 00 секунд\n", N,K);
printf("сейчас идет %d минута\n",K);
printf("До полуночи осталось %d часов и %d минут\n", N,K);
printf("С 8.00 прошло %d секунд\n",N);
printf("Текущий час  = %.2f суток  и текущая минута =  %.2f часа\n", K/24.0,N/60.0);
}
void z3()

{
int k=5,l=323,n=4,m=1;
printf ("данные: %+d %+d\nрезультат: %+*.*f",n,l,k,m,(double)n/l);

}